#include <iostream>

using namespace std;

// يحتوي على 4 متغيرات Book هنا قمنا بتعريف كلاس إسمه
class Book {

public:
    
    // هنا قمنا بتعريف الكونستركتور الذي سنقوم باستدعائه حين ننشئ كائن من الكلاس
    Book()
    {
        cout << "Constructor is called" << endl;
    }
    
    // هنا قمنا بتعريف الدستركتور الذي سيتم استدعائه بشكل تلقائي حين يتم حذف الكائن من الذاكرة
    ~Book()
    {
        cout << "Destructor is called" << endl;
    }

};


// main() هنا قمنا بتعريف الدالة
int main()
{
    // و بالتالي سيتم تنفيذ أمر الطباعة الموجود في الكونستركتور Book هنا قمنا بتعريف كائن من
    Book book;

    // بما أن البرنامج إنتهى هنا فهذا يعني أنه سيتم تنفيذ أمر الطباعة الموجود في الدستركتور
    return 0;
}