
// public	تستخدم لتحديد أن الأشياء الموضوعة في الكلاس يمكن الوصول لها من أي مكان.
// private	تستخدم لتحديد أن الأشياء الموضوعة في الكلاس لا يمكن الوصول لها من خارجه.
// protected	تستخدم لتحديد أن الأشياء الموضوعة في الكلاس يمكن الوصول لها عند وراثتها.
// ملاحظة: سنتعلم الوراثة في دروس لاحقة.

// class Book {
    
//     public:
//         // public هنا أي شيء نقوم بتعريفه يعتبر أنه
        
//     private:
//         // private هنا أي شيء نقوم بتعريفه يعتبر أنه
        
//     protected:
//         // protected هنا أي شيء نقوم بتعريفه يعتبر أنه
    
// };













