#include <iostream>

using namespace std;

// Demo هنا قمنا بتعريف الكلاس
class Demo {

    // y و المتغير المشترك x هنا قمنا بتعريف المتغير
    public:
        int x;
        static int y;

};

// القيمة 0 كقيمة أولية y هنا قمنا بإعطاء المتغير المشترك
int Demo::y = 0;

// main() هنا قمنا بتعريف الدالة
int main()
{
    // Demo هنا قمنا بتعريف ثلاث كائنات من الكلاس
    Demo demo1, demo2, demo3;

    // التي يملكها كل كائن قمنا بإنشائه x هنا قمنا بتغيير قيمة المتغير
    demo1.x = 10;
    demo2.x = 20;
    demo3.x = 30;

    // التي يملكها كل كائن قمنا بإنشائه x هنا قمنا بطباعة قيمة المتغير
    cout << "demo1.x = " << demo1.x << endl;
    cout << "demo2.x = " << demo2.x << endl;
    cout << "demo3.x = " << demo3.x << endl;

    // التي هي نفسها لكل الكائنات و بالطبع الآن قيمته هي 0 لأننا لم نقم بتغيير قيمته الأولية y هنا قمنا بطباعة قيمة المتغير المشترك
    cout << "Demo.y = " << demo1.y << endl;
    cout << "Demo.y = " << demo2.y << endl;
    cout << "Demo.y = " << demo3.y << endl;

    // demo1 إلى 5 من خلال الكائن y هنا قمنا بتغيير قيمة
    // سيتم إعتبار أنها تغييرت بالنسبة لجميع الكائنات لأنها مشتركة فيما بينهم demo3 أو demo2 أو demo1 ملاحظة: سواء غيرناها من خلال الكائن
    demo1.y = 5;

    // demo1 من جديد للتأكد ما إن كانت حقاً أصبحت تساوي 5 أم لا بالنسبة لجميع الكائنات و ليس فقط الكائن y هنا قمنا بطباعة قيمة المتغير المشترك
    cout << "Demo.y = " << demo1.y << endl;
    cout << "Demo.y = " << demo2.y << endl;
    cout << "Demo.y = " << demo3.y << endl;

    return 0;
}